{
  "bns_2023": {
    "name": "Bharatiya Nyaya Sanhita 2023",
    "sections": {
      "115": {
        "title": "Voluntarily causing hurt",
        "description": "Whoever voluntarily causes hurt shall be punished with imprisonment of either description for a term which may extend to one year, or with fine which may extend to ten thousand rupees, or with both.",
        "keywords": ["hurt", "injury", "assault", "physical harm"]
      },
      "116": {
        "title": "Voluntarily causing grievous hurt",
        "description": "Whoever voluntarily causes grievous hurt shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.",
        "keywords": ["grievous hurt", "serious injury", "permanent damage"]
      },
      "223": {
        "title": "Public servant disobeying law, with intent to cause injury to any person",
        "description": "Whoever, being a public servant, knowingly disobeys any direction of the law as to the way in which he is to conduct himself as such public servant, intending to cause, or knowing it to be likely that he will thereby cause, injury to any person, shall be punished with simple imprisonment for a term which may extend to one year, or with fine, or with both.",
        "keywords": ["public servant", "disobedience", "misconduct"]
      },
      "309": {
        "title": "Robbery",
        "description": "Whoever commits robbery shall be punished with rigorous imprisonment for a term which may extend to ten years, and shall also be liable to fine; and, if the robbery be committed on the highway between sunset and sunrise, the imprisonment may be extended to fourteen years.",
        "keywords": ["robbery", "theft", "force", "snatching", "highway robbery"]
      },
      "310": {
        "title": "Dacoity",
        "description": "When five or more persons conjointly commit or attempt to commit a robbery, or where the whole number of persons conjointly committing or attempting to commit a robbery, and persons present and aiding such commission or attempt, amount to five or more, every person so committing, attempting or aiding, is said to commit dacoity.",
        "keywords": ["dacoity", "gang robbery", "group crime", "five or more persons"]
      },
      "351": {
        "title": "Criminal intimidation",
        "description": "Whoever threatens another with any injury to his person, reputation or property, or to the person or reputation of any one in whom that person is interested, with intent to cause alarm to that person, or to cause that person to do any act which he is not legally bound to do, or to omit to do any act which that person is legally entitled to do, as the means of avoiding the execution of such threat, commits criminal intimidation.",
        "keywords": ["threat", "intimidation", "fear", "coercion"]
      },
      "352": {
        "title": "Punishment for criminal intimidation",
        "description": "Whoever commits criminal intimidation shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both; if threat be to cause death or grievous hurt, etc.—and if the threat be to cause death or grievous hurt, or to cause the destruction of any property by fire, or to cause an offence punishable with death or imprisonment for life, or with imprisonment for a term which may extend to seven years, or to impute unchastity to a woman, shall be punished with imprisonment of either description for a term which may extend to seven years, or with fine, or with both.",
        "keywords": ["criminal intimidation punishment", "threat punishment"]
      }
    }
  },
  "sc_st_act": {
    "name": "Scheduled Castes and Scheduled Tribes (Prevention of Atrocities) Act, 1989",
    "sections": {
      "3(1)(r)": {
        "title": "Abuses or humiliates members of SC/ST",
        "description": "Whoever, not being a member of a Scheduled Caste or a Scheduled Tribe, abuses or humiliates a member of a Scheduled Caste or a Scheduled Tribe in any place within public view.",
        "keywords": ["caste abuse", "humiliation", "scheduled caste", "scheduled tribe", "public humiliation"]
      },
      "3(1)(s)": {
        "title": "Promotes or attempts to promote feelings of enmity, hatred or ill-will against SC/ST",
        "description": "Whoever promotes or attempts to promote feelings of enmity, hatred or ill-will against members of the Scheduled Castes or the Scheduled Tribes.",
        "keywords": ["enmity", "hatred", "ill-will", "caste discrimination"]
      },
      "3(1)(u)": {
        "title": "Intentionally insults or intimidates with intent to humiliate SC/ST",
        "description": "Whoever intentionally insults or intimidates with intent to humiliate a member of a Scheduled Caste or a Scheduled Tribe in any place within public view.",
        "keywords": ["insult", "intimidate", "humiliate", "public view"]
      },
      "3(1)(w)": {
        "title": "Assaults or uses force on SC/ST woman with intent to dishonour",
        "description": "Whoever assaults or uses force to any woman belonging to a Scheduled Caste or a Scheduled Tribe with intent to dishonour or outrage her modesty.",
        "keywords": ["assault on SC/ST woman", "dishonour", "modesty", "force"]
      },
      "3(2)(v)": {
        "title": "Gives or fabricates false evidence intending to cause SC/ST to be convicted",
        "description": "Whoever gives or fabricates false evidence intending thereby to cause, or knowing it to be likely that he will thereby cause, any member of a Scheduled Caste or a Scheduled Tribe to be convicted of an offence which is capital or punishable with imprisonment for life or imprisonment for a term of ten years or upwards.",
        "keywords": ["false evidence", "fabricated evidence", "wrongful conviction"]
      }
    }
  },
  "arms_act": {
    "name": "Arms Act, 1959",
    "sections": {
      "25": {
        "title": "Punishment for contravention of license or rule",
        "description": "Whoever acquires, has in his possession or carries any prohibited arms or prohibited ammunition shall be punishable with imprisonment for a term which shall not be less than five years but which may extend to ten years and shall also be liable to fine.",
        "keywords": ["prohibited arms", "illegal weapons", "unlicensed firearms", "ammunition"]
      },
      "26": {
        "title": "Punishment for using arms, etc., in contravention of section 5",
        "description": "Whoever uses any arms or ammunition in contravention of section 5 shall be punishable with imprisonment for a term which may extend to three years, or with fine, or with both.",
        "keywords": ["illegal use of arms", "unauthorized weapon use"]
      },
      "27": {
        "title": "Punishment for using arms, etc., in contravention of section 7",
        "description": "Whoever uses any arms or ammunition in contravention of section 7 shall be punishable with imprisonment for a term which may extend to two years, or with fine which may extend to five thousand rupees, or with both.",
        "keywords": ["contravention of section 7", "improper use of licensed arms"]
      }
    }
  },
  "ipc_relevant": {
    "name": "Indian Penal Code (Still Applicable)",
    "sections": {
      "153A": {
        "title": "Promoting enmity between different groups",
        "description": "Whoever by words, either spoken or written, or by signs or by visible representations or otherwise, promotes or attempts to promote, on grounds of religion, race, place of birth, residence, language, caste or community or any other ground whatsoever, disharmony or feelings of enmity, hatred or ill-will between different religious, racial, language or regional groups or castes or communities.",
        "keywords": ["communal harmony", "religious enmity", "caste enmity", "hate speech"]
      },
      "506": {
        "title": "Punishment for criminal intimidation",
        "description": "Whoever commits criminal intimidation shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.",
        "keywords": ["criminal intimidation", "threat", "fear"]
      }
    }
  },
  "offence_mapping": {
    "caste_discrimination": ["sc_st_act.3(1)(r)", "sc_st_act.3(1)(s)", "sc_st_act.3(1)(u)", "ipc_relevant.153A"],
    "physical_assault": ["bns_2023.115", "bns_2023.116"],
    "robbery_theft": ["bns_2023.309", "bns_2023.310"],
    "criminal_intimidation": ["bns_2023.351", "bns_2023.352", "ipc_relevant.506"],
    "illegal_arms": ["arms_act.25", "arms_act.26", "arms_act.27"],
    "public_humiliation": ["sc_st_act.3(1)(r)", "sc_st_act.3(1)(u)"],
    "false_evidence": ["sc_st_act.3(2)(v)"],
    "assault_on_women": ["sc_st_act.3(1)(w)", "bns_2023.115"]
  },
  "keywords_to_sections": {
    "caste": ["sc_st_act.3(1)(r)", "sc_st_act.3(1)(s)", "ipc_relevant.153A"],
    "scheduled caste": ["sc_st_act.3(1)(r)", "sc_st_act.3(1)(s)", "sc_st_act.3(1)(u)"],
    "scheduled tribe": ["sc_st_act.3(1)(r)", "sc_st_act.3(1)(s)", "sc_st_act.3(1)(u)"],
    "abuse": ["sc_st_act.3(1)(r)", "bns_2023.115"],
    "humiliation": ["sc_st_act.3(1)(r)", "sc_st_act.3(1)(u)"],
    "robbery": ["bns_2023.309"],
    "theft": ["bns_2023.309"],
    "snatching": ["bns_2023.309"],
    "assault": ["bns_2023.115", "bns_2023.116"],
    "hurt": ["bns_2023.115", "bns_2023.116"],
    "injury": ["bns_2023.115", "bns_2023.116"],
    "threat": ["bns_2023.351", "bns_2023.352", "ipc_relevant.506"],
    "intimidation": ["bns_2023.351", "bns_2023.352", "sc_st_act.3(1)(u)"],
    "weapon": ["arms_act.25", "arms_act.26"],
    "pistol": ["arms_act.25"],
    "gun": ["arms_act.25"],
    "firearm": ["arms_act.25"],
    "arms": ["arms_act.25", "arms_act.26", "arms_act.27"],
    "dacoity": ["bns_2023.310"],
    "gang": ["bns_2023.310"],
    "enmity": ["sc_st_act.3(1)(s)", "ipc_relevant.153A"],
    "hatred": ["sc_st_act.3(1)(s)", "ipc_relevant.153A"],
    "dishonour": ["sc_st_act.3(1)(w)"],
    "modesty": ["sc_st_act.3(1)(w)"],
    "false evidence": ["sc_st_act.3(2)(v)"]
  },
  "severity_levels": {
    "high": {
      "sections": ["bns_2023.309", "bns_2023.310", "bns_2023.116", "arms_act.25", "sc_st_act.3(1)(w)", "sc_st_act.3(2)(v)"],
      "description": "Serious offences with significant punishment"
    },
    "medium": {
      "sections": ["bns_2023.115", "bns_2023.351", "bns_2023.352", "sc_st_act.3(1)(r)", "sc_st_act.3(1)(s)", "sc_st_act.3(1)(u)"],
      "description": "Moderate offences requiring legal action"
    },
    "low": {
      "sections": ["arms_act.26", "arms_act.27", "ipc_relevant.506"],
      "description": "Lesser offences but still punishable"
    }
  }
}